# Student Alcohol Consumption

### Introduction:

This time you will download a dataset from the UCI.

### Step 1. Import the necessary libraries

In [24]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/nursnaaz/Inceptez/master/Batch-8/Pandas%20Test/Students_Alcohol_Consumption.csv).

### Step 3. Assign it to a variable called df.

In [2]:
df=pd.read_csv('https://raw.githubusercontent.com/nursnaaz/Inceptez/master/Batch-8/Pandas%20Test/Students_Alcohol_Consumption.csv')

### Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [3]:
df=df.iloc[:,0:12]

### Step 5. Create a lambda function that captalize strings.

In [13]:
def df_upper(x):
    return x.capitalize();

### Step 6. Capitalize both Mjob and Fjob

In [14]:
df['Mjob']=df['Mjob'].apply(lambda x : df_upper(x))
df['Fjob']=df['Fjob'].apply(lambda x : df_upper(x))

### Step 7. Print the last elements of the data set.

In [19]:
df.tail(1)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
394,MS,M,19,U,LE3,T,1,1,Other,At_home,Course,Father

### Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and captalize Mjob and Fjob.

In [18]:
df['reason']=df['reason'].apply(lambda x : df_upper(x))
df['guardian']=df['guardian'].apply(lambda x : df_upper(x))

### Step 9. Create a function called majority that return a boolean value to a new column called legal_drinker (Consider majority as older than 17 years old)

In [20]:
df.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
390,MS,M,20,U,LE3,A,2,2,Services,Services,Course,Other
391,MS,M,17,U,LE3,T,3,1,Services,Services,Course,Mother
392,MS,M,21,R,GT3,T,1,1,Other,Other,Course,Other
393,MS,M,18,R,LE3,T,3,2,Services,Other,Course,Mother
394,MS,M,19,U,LE3,T,1,1,Other,At_home,Course,Father

In [22]:
def val_legal_drinker(x):
    if x > 17:
        return True
    else:
        return False

df['legal_drinker']=df['age'].apply(lambda x : val_legal_drinker(x))

In [23]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,18,U,GT3,A,4,4,At_home,Teacher,Course,Mother,True
1,GP,F,17,U,GT3,T,1,1,At_home,Other,Course,Father,False
2,GP,F,15,U,LE3,T,1,1,At_home,Other,Other,Mother,False
3,GP,F,15,U,GT3,T,4,2,Health,Services,Home,Mother,False
4,GP,F,16,U,GT3,T,3,3,Other,Other,Home,Father,False

### Step 10. Multiply every number of the dataset by 10. 
##### I know this makes no sense, don't forget it is just an exercise

In [41]:
def multi_dataset():
    for i in df.select_dtypes(include=np.number).columns.tolist():
        df[i]=df[i]/10

In [42]:
multi_dataset()

In [43]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_drinker
0,GP,F,1.8,U,GT3,A,0.4,0.4,At_home,Teacher,Course,Mother,True
1,GP,F,1.7,U,GT3,T,0.1,0.1,At_home,Other,Course,Father,False
2,GP,F,1.5,U,LE3,T,0.1,0.1,At_home,Other,Other,Mother,False
3,GP,F,1.5,U,GT3,T,0.4,0.2,Health,Services,Home,Mother,False
4,GP,F,1.6,U,GT3,T,0.3,0.3,Other,Other,Home,Father,False